
CliArgs_Help = \u043F\u043E\u043A\u0430\u0437\u0430\u0442\u044C \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0443 \u043F\u043E\u043C\u043E\u0449\u0438

CliArgs_Version = \u043F\u043E\u043A\u0430\u0437\u0430\u0442\u044C \u0432\u0435\u0440\u0441\u0438\u044E

CliArgs_add_transaction = \u043E\u0431\u0435\u0440\u043D\u0443\u0442\u044C \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u0439 \u0441\u043A\u0440\u0438\u043F\u0442 \u0432 \u0431\u043B\u043E\u043A \u0442\u0440\u0430\u043D\u0437\u0430\u043A\u0446\u0438\u0438

CliArgs_allow_danger_ddl = \u0440\u0430\u0437\u0440\u0435\u0448\u0438\u0442\u044C \u043E\u043F\u0430\u0441\u043D\u044B\u0435 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u044B \u0432 \u0441\u043A\u0440\u0438\u043F\u0442\u0430\u0445 \u0432 \u0431\u0435\u0437\u043E\u043F\u0430\u0441\u043D\u043E\u043C \u0440\u0435\u0436\u0438\u043C\u0435

CliArgs_allowed_object = \u043F\u043E\u0441\u0442\u0440\u043E\u0438\u0442\u044C \u0441\u043A\u0440\u0438\u043F\u0442, \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u044D\u0442\u0438 \u0442\u0438\u043F\u044B \u043E\u0431\u044A\u0435\u043A\u0442\u043E\u0432 \u0438 \u0441\u043A\u0440\u044B\u0432\u0430\u044F \u043E\u0431\u044A\u0435\u043A\u0442\u044B \u0434\u0440\u0443\u0433\u0438\u0445 \u0442\u0438\u043F\u043E\u0432

CliArgs_clear_lib_cache = \u043E\u0447\u0438\u0441\u0442\u0438\u0442\u044C \u043A\u044D\u0448 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A

CliArgs_comments_to_end = \u043F\u0435\u0447\u0430\u0442\u0430\u0442\u044C \u043A\u043E\u043C\u043C\u0435\u043D\u0442\u0430\u0440\u0438\u0438 \u0432 \u043A\u043E\u043D\u0446\u0435 \u0441\u043A\u0440\u0438\u043F\u0442\u0430

CliArgs_concurrently_mode = \u043F\u0435\u0447\u0430\u0442\u0430\u0442\u044C CREATE INDEX \u0441 \u043E\u043F\u0446\u0438\u0435\u0439 CONCURRENTLY \u0434\u043B\u044F PostgreSQL \u0438 WITH ONLINE = ON \u0434\u043B\u044F MS SQL

CliArgs_db_type = \u0443\u043A\u0430\u0437\u0430\u0442\u044C \u0442\u0438\u043F \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445 \u0434\u043B\u044F \u0440\u0430\u0431\u043E\u0442\u044B: PG, MS, CH

CliArgs_drop_before_create = \u043F\u0435\u0447\u0430\u0442\u0430\u0442\u044C DROP \u043F\u0435\u0440\u0435\u0434 CREATE \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u0435\u0439

CliArgs_enable_function_bodies_dependencies = \u0432\u043A\u043B\u044E\u0447\u0438\u0442\u044C \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u043E\u0441\u0442\u0438 \u043E\u0442 \u0442\u0435\u043B \u0444\u0443\u043D\u043A\u0446\u0438\u0439 \u0438 \u043F\u0440\u043E\u0446\u0435\u0434\u0443\u0440 \u043A \u0434\u0440\u0443\u0433\u0438\u043C \u0444\u0443\u043D\u043A\u0446\u0438\u044F\u043C \u0438\u043B\u0438 \u043F\u0440\u043E\u0446\u0435\u0434\u0443\u0440\u0430\u043C

CliArgs_error_argument_null = \u041F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u0443\u043A\u0430\u0436\u0438\u0442\u0435 \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442 %s

CliArgs_error_concurrently_mode_wrong_option = -C (--concurrently-mode) \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u0441 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u043E\u043C -X (--add-transaction) \u0434\u043B\u044F PostgreSQL.

CliArgs_error_different_types = \u0418\u0441\u0442\u043E\u0447\u043D\u0438\u043A (%s) \u0438 \u043F\u0440\u0438\u0435\u043C\u043D\u0438\u043A (%s) \u0440\u0430\u0437\u043B\u0438\u0447\u0430\u044E\u0442\u0441\u044F \u043F\u043E \u0442\u0438\u043F\u0443, \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u043F\u0440\u043E\u043F\u0443\u0449\u0435\u043D \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440 --db-type.

CliArgs_error_message_cannot_database_with_project = \u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0440\u0430\u0431\u043E\u0442\u0430\u0442\u044C \u0441 \u0431\u0430\u0437\u043E\u0439 \u0434\u0430\u043D\u043D\u044B\u0445 %s \u043A\u0430\u043A \u0441 \u043F\u0440\u043E\u0435\u043A\u0442\u043E\u043C %s.

CliArgs_error_run_on_non_jdbc = \u041F\u0430\u0440\u0430\u043C\u0435\u0442\u0440 -R (--run-on) \u0434\u043E\u043B\u0436\u0435\u043D \u0443\u043A\u0430\u0437\u044B\u0432\u0430\u0442\u044C \u0441\u0442\u0440\u043E\u043A\u0443 \u043F\u043E\u0434\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u044F JDBC.

CliArgs_error_source_dest = \u041F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u0443\u043A\u0430\u0436\u0438\u0442\u0435 \u043E\u0431\u0430 \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442\u0430 SOURCE \u0438 DEST.

CliArgs_error_source_non_db = \u0418\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u043E\u043C \u0434\u043E\u043B\u0436\u043D\u0430 \u0431\u044B\u0442\u044C \u0431\u0430\u0437\u0430 \u0434\u0430\u043D\u043D\u044B\u0445.

CliArgs_error_source_null = \u041F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u0443\u043A\u0430\u0436\u0438\u0442\u0435 SOURCE.

CliArgs_error_target_non_db = \u0421\u043A\u0440\u0438\u043F\u0442 \u043C\u043E\u0436\u043D\u043E \u043F\u0440\u0438\u043C\u0435\u043D\u0438\u0442\u044C \u0442\u043E\u043B\u044C\u043A\u043E \u043A \u0431\u0430\u0437\u0435 \u0434\u0430\u043D\u043D\u044B\u0445.

CliArgs_error_wrong_db_type = {0} \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D \u0441 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u043E\u043C --db-type {1}

CliArgs_error_wrong_mode = {0} \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C\u0441\u044F c \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u043E\u043C --mode {1}

CliArgs_generate_constraint_not_valid = \u043F\u0435\u0447\u0430\u0442\u0430\u0442\u044C CONSTRAINT NOT VALID \u0434\u043B\u044F \u043D\u0435 \u043F\u0430\u0440\u0442\u0438\u0446\u0438\u043E\u043D\u043D\u044B\u0445 \u0442\u0430\u0431\u043B\u0438\u0446

CliArgs_generate_exist = \u043F\u0435\u0447\u0430\u0442\u0430\u0442\u044C CREATE IF NOT EXISTS / DROP IF EXISTS

CliArgs_generate_exist_do_block = \u043F\u0435\u0447\u0430\u0442\u0430\u0442\u044C CONSTRAINT \u0438 IDENTITY \u0432 \u0431\u043B\u043E\u043A\u0435 DO (\u0442\u043E\u043B\u044C\u043A\u043E PG)

CliArgs_graph = \u0443\u0441\u0442\u0430\u0440\u0435\u0432\u0448\u0438\u0439 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440. \u0418\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 --mode GRAPH. \u0417\u0430\u043F\u0443\u0441\u043A \u0432 \u0440\u0435\u0436\u0438\u043C\u0435 graph \u0434\u043B\u044F \u043E\u0442\u043E\u0431\u0440\u0430\u0436\u0435\u043D\u0438\u044F \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u043E\u0441\u0442\u0435\u0439 \u043E\u0431\u044A\u0435\u043A\u0442\u043E\u0432.

CliArgs_graph_depth = \u0433\u043B\u0443\u0431\u0438\u043D\u0430 \u043E\u0442\u043E\u0431\u0440\u0430\u0436\u0430\u0435\u043C\u044B\u0445 \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u043E\u0441\u0442\u0435\u0439 \u0432 \u0440\u0435\u0436\u0438\u043C\u0435 graph

CliArgs_graph_filter_object = \u043F\u043E\u043A\u0430\u0437\u0430\u0442\u044C \u044D\u0442\u0438 \u0442\u0438\u043F\u044B \u043E\u0431\u044A\u0435\u043A\u0442\u043E\u0432, \u0441\u043A\u0440\u044B\u0442\u044C \u0434\u0440\u0443\u0433\u0438\u0435 \u0442\u0438\u043F\u044B \u043E\u0431\u044A\u0435\u043A\u0442\u043E\u0432

CliArgs_graph_invert_filter = \u0438\u043D\u0432\u0435\u0440\u0442\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0442\u0438\u043F\u044B \u043E\u0431\u044A\u0435\u043A\u0442\u043E\u0432 \u0444\u0438\u043B\u044C\u0442\u0440\u0430 \u0433\u0440\u0430\u0444\u0430: \u0441\u043A\u0440\u044B\u0442\u044C \u043E\u0431\u044A\u0435\u043A\u0442\u044B, \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u044B\u0435 \u0432 \u0444\u0438\u043B\u044C\u0442\u0440\u0435

CliArgs_graph_name = \u0438\u043C\u044F \u043D\u0430\u0447\u0430\u043B\u044C\u043D\u043E\u0433\u043E \u043E\u0431\u044A\u0435\u043A\u0442\u0430 \u0432 \u0440\u0435\u0436\u0438\u043C\u0435 graph\n\u0443\u043A\u0430\u0436\u0438\u0442\u0435 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0440\u0430\u0437, \u0447\u0442\u043E\u0431\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0438\u043C\u0435\u043D

CliArgs_graph_reverse = \u0438\u0437\u043C\u0435\u043D\u0438\u0442\u044C \u043D\u0430\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u0435 \u0433\u0440\u0430\u0444\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u043E\u043A\u0430\u0437\u0430\u0442\u044C \u043E\u0431\u044A\u0435\u043A\u0442\u044B, \u043E\u0442 \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u0437\u0430\u0432\u0438\u0441\u0438\u0442 \u0438\u0441\u0445\u043E\u0434\u043D\u044B\u0439 \u043E\u0431\u044A\u0435\u043A\u0442

CliArgs_ignore_column_order = \u0438\u0433\u043D\u043E\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0440\u0430\u0437\u043B\u0438\u0447\u0438\u044F \u0432 \u043F\u043E\u0440\u044F\u0434\u043A\u0435 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u044B

CliArgs_ignore_concurrent_modification = \u0438\u0433\u043D\u043E\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u043E\u0448\u0438\u0431\u043A\u0438 \u043E\u0434\u043D\u043E\u0432\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0439 \u043C\u043E\u0434\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u0438 \u043E\u0431\u044A\u0435\u043A\u0442\u043E\u0432 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445

CliArgs_ignore_errors = \u043D\u0435 \u043E\u0441\u0442\u0430\u043D\u0430\u0432\u043B\u0438\u0432\u0430\u0442\u044C \u0440\u0430\u0431\u043E\u0442\u0443 \u043F\u0440\u0438 \u043E\u0448\u0438\u0431\u043A\u0430\u0445 \u043F\u0430\u0440\u0441\u0438\u043D\u0433\u0430

CliArgs_ignore_list = \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 \u0441\u043F\u0438\u0441\u043E\u043A \u0438\u0433\u043D\u043E\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u0434\u043B\u044F \u0432\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u044F/\u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u044F \u043E\u0431\u044A\u0435\u043A\u0442\u043E\u0432 \u0438\u0437 \u0441\u043F\u0438\u0441\u043A\u0430 \u0440\u0430\u0437\u043B\u0438\u0447\u0438\u0439\n\u0443\u043A\u0430\u0436\u0438\u0442\u0435 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0440\u0430\u0437, \u0447\u0442\u043E\u0431\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0441\u043F\u0438\u0441\u043A\u043E\u0432

CliArgs_ignore_schema = \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 \u0441\u043F\u0438\u0441\u043E\u043A \u0438\u0433\u043D\u043E\u0440\u0438\u0440\u0443\u0435\u043C\u044B\u0445 \u0441\u0445\u0435\u043C \u0434\u043B\u044F \u0432\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u044F/\u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u044F \u0441\u0445\u0435\u043C \u043D\u0430 \u044D\u0442\u0430\u043F\u0435 \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0438

CliArgs_in_charset = \u043A\u043E\u0434\u0438\u0440\u043E\u0432\u043A\u0430 \u0432\u0432\u043E\u0434\u0430

CliArgs_insert = \u0443\u0441\u0442\u0430\u0440\u0435\u0432\u0448\u0438\u0439 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440. \u0418\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 --mode INSERT. \u0417\u0430\u043F\u0443\u0441\u043A \u0432 \u0440\u0435\u0436\u0438\u043C\u0435 \u0432\u0441\u0442\u0430\u0432\u043A\u0438 \u0434\u043B\u044F \u0441\u0431\u043E\u0440\u0430 \u0434\u0430\u043D\u043D\u044B\u0445

CliArgs_insert_filter = \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u044F WHERE \u0434\u043B\u044F \u043F\u0435\u0440\u0432\u043E\u043D\u0430\u0447\u0430\u043B\u044C\u043D\u043E\u0439 \u0432\u044B\u0431\u043E\u0440\u043A\u0438 \u0432 \u0440\u0435\u0436\u0438\u043C\u0435 insert

CliArgs_insert_name = \u0438\u043C\u044F \u043D\u0430\u0447\u0430\u043B\u044C\u043D\u043E\u0433\u043E \u043E\u0431\u044A\u0435\u043A\u0442\u0430 \u0432 \u0440\u0435\u0436\u0438\u043C\u0435 insert

CliArgs_keep_newlines = \u0441\u043E\u0445\u0440\u0430\u043D\u0438\u0442\u044C \u0441\u0438\u043C\u0432\u043E\u043B\u044B \u043F\u0435\u0440\u0435\u043D\u043E\u0441\u0430 \u0441\u0442\u0440\u043E\u043A\u0438 \u043A\u0430\u043A \u0435\u0441\u0442\u044C (\u043D\u0435 \u043A\u043E\u043D\u0432\u0435\u0440\u0442\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0432 \u043F\u0435\u0440\u0435\u043D\u043E\u0441\u044B \u0441\u0442\u0440\u043E\u043A Unix)

CliArgs_lib_safe_mode = \u0432\u044B\u0445\u043E\u0434\u0438\u0442\u044C \u0441 \u043E\u0448\u0438\u0431\u043A\u043E\u0439, \u0435\u0441\u043B\u0438 \u043E\u0431\u044A\u0435\u043A\u0442 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0438 \u043A\u043E\u043D\u0444\u043B\u0438\u043A\u0442\u0443\u0435\u0442 \u0441 \u0434\u0440\u0443\u0433\u0438\u043C\u0438 \u043E\u0431\u044A\u0435\u043A\u0442\u0430\u043C\u0438 \u0441\u0445\u0435\u043C\u044B \u0438\u043B\u0438 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0438\n\u0432 \u043F\u0440\u043E\u0442\u0438\u0432\u043D\u043E\u043C \u0441\u043B\u0443\u0447\u0430\u0435, \u0432 \u0441\u043B\u0443\u0447\u0430\u0435 \u043A\u043E\u043D\u0444\u043B\u0438\u043A\u0442\u043E\u0432 \u043F\u0440\u0438\u043E\u0440\u0438\u0442\u0435\u0442 \u0438\u043C\u0435\u044E\u0442 \u043E\u0431\u044A\u0435\u043A\u0442\u044B, \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043D\u043D\u044B\u0435 \u043F\u0435\u0440\u0432\u044B\u043C\u0438

CliArgs_list_charsets = \u043F\u043E\u043A\u0430\u0437\u0430\u0442\u044C \u0441\u043F\u0438\u0441\u043E\u043A \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u043C\u044B\u0445 Java \u043A\u043E\u0434\u0438\u0440\u043E\u0432\u043E\u043A

CliArgs_migrate_data = \u043F\u0435\u0440\u0435\u043D\u043E\u0441\u0438\u0442\u044C \u0434\u0430\u043D\u043D\u044B\u0435 \u043F\u0440\u0438 \u043F\u0435\u0440\u0435\u0441\u043E\u0437\u0434\u0430\u043D\u0438\u0438 \u0442\u0430\u0431\u043B\u0438\u0446

CliArgs_mode = \u0443\u043A\u0430\u0436\u0438\u0442\u0435 \u0440\u0435\u0436\u0438\u043C:\nDIFF - \u0434\u043B\u044F \u0441\u0440\u0430\u0432\u043D\u0435\u043D\u0438\u044F \u0434\u0432\u0443\u0445 \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u043E\u0432 \u0438 \u0433\u0435\u043D\u0435\u0440\u0430\u0446\u0438\u0438 \u0441\u043A\u0440\u0438\u043F\u0442\u0430 \u043C\u0438\u0433\u0440\u0430\u0446\u0438\u0438;\nPARSE - \u0434\u043B\u044F \u0441\u043E\u0445\u0440\u0430\u043D\u0435\u043D\u0438\u044F \u0441\u0445\u0435\u043C\u044B \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445 \u0432 \u0432\u0438\u0434\u0435 \u0438\u0435\u0440\u0430\u0440\u0445\u0438\u0438 \u043A\u0430\u0442\u0430\u043B\u043E\u0433\u043E\u0432;\nGRAPH - \u0434\u043B\u044F \u043F\u043E\u0438\u0441\u043A\u0430 \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u043E\u0441\u0442\u0435\u0439 \u043E\u0431\u044A\u0435\u043A\u0442\u0430;\nINSERT - \u0434\u043B\u044F \u0441\u0431\u043E\u0440\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 \u0438\u0437 \u0438\u0441\u0445\u043E\u0434\u043D\u043E\u0439 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445 \u0441 \u0443\u0447\u0435\u0442\u043E\u043C \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u043E\u0441\u0442\u0435\u0439 FK;\nVERIFY - \u0434\u043B\u044F \u0432\u0435\u0440\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u0438 \u043A\u043E\u0434\u0430;

CliArgs_no_check_function_bodies = \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u0438\u0442\u044C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 false \u0434\u043B\u044F check_function_bodies \u0432 \u043D\u0430\u0447\u0430\u043B\u0435 \u0441\u043A\u0440\u0438\u043F\u0442\u0430

CliArgs_no_privileges = \u0438\u0433\u043D\u043E\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u043F\u0440\u0438\u0432\u0438\u043B\u0435\u0433\u0438\u0438 \u0438 \u0432\u043B\u0430\u0434\u0435\u043B\u044C\u0446\u0435\u0432 \u043E\u0431\u044A\u0435\u043A\u0442\u043E\u0432 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445

CliArgs_out_charset = \u043A\u043E\u0434\u0438\u0440\u043E\u0432\u043A\u0430 \u0432\u044B\u0432\u043E\u0434\u0430

CliArgs_output = \u0444\u0430\u0439\u043B \u0432\u044B\u0432\u043E\u0434\u0430 \u0441\u043A\u0440\u0438\u043F\u0442\u0430 \u0438\u043B\u0438 \u043A\u0430\u0442\u0430\u043B\u043E\u0433 \u0432\u044B\u0432\u043E\u0434\u0430 \u043F\u0430\u0440\u0441\u0435\u0440\u0430

CliArgs_parse = \u0443\u0441\u0442\u0430\u0440\u0435\u0432\u0448\u0438\u0439 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440. \u0418\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 --mode PARSE. \u0417\u0430\u043F\u0443\u0441\u043A \u0432 \u0440\u0435\u0436\u0438\u043C\u0435 \u043F\u0430\u0440\u0441\u0435\u0440\u0430 \u0434\u043B\u044F \u0441\u043E\u0445\u0440\u0430\u043D\u0435\u043D\u0438\u044F \u0441\u0445\u0435\u043C\u044B \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445 \u0432 \u0432\u0438\u0434\u0435 \u0438\u0435\u0440\u0430\u0440\u0445\u0438\u0438 \u043A\u0430\u0442\u0430\u043B\u043E\u0433\u043E\u0432

CliArgs_post_script = \u043F\u0443\u0442\u044C \u043A \u0444\u0430\u0439\u043B\u0443 POST \u0441\u043A\u0440\u0438\u043F\u0442\u0430 \u0438\u043B\u0438 \u043A\u0430\u0442\u0430\u043B\u043E\u0433\u0443 \u0441 POST \u0441\u043A\u0440\u0438\u043F\u0442\u0430\u043C\u0438\n\u0432\u043B\u043E\u0436\u0435\u043D\u043D\u044B\u0435 \u043A\u0430\u0442\u0430\u043B\u043E\u0433\u0438 \u0437\u0430\u0433\u0440\u0443\u0436\u0430\u044E\u0442\u0441\u044F \u0440\u0435\u043A\u0443\u0440\u0441\u0438\u0432\u043D\u043E\n\u0443\u043A\u0430\u0436\u0438\u0442\u0435 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0440\u0430\u0437, \u0447\u0442\u043E\u0431\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u043F\u0443\u0442\u0435\u0439

CliArgs_pre_script = \u043F\u0443\u0442\u044C \u043A \u0444\u0430\u0439\u043B\u0443 PRE \u0441\u043A\u0440\u0438\u043F\u0442\u0430 \u0438\u043B\u0438 \u043A\u0430\u0442\u0430\u043B\u043E\u0433\u0443 \u0441 PRE \u0441\u043A\u0440\u0438\u043F\u0442\u0430\u043C\u0438\n\u0432\u043B\u043E\u0436\u0435\u043D\u043D\u044B\u0435 \u043A\u0430\u0442\u0430\u043B\u043E\u0433\u0438 \u0437\u0430\u0433\u0440\u0443\u0436\u0430\u044E\u0442\u0441\u044F \u0440\u0435\u043A\u0443\u0440\u0441\u0438\u0432\u043D\u043E\n\u0443\u043A\u0430\u0436\u0438\u0442\u0435 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0440\u0430\u0437, \u0447\u0442\u043E\u0431\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u043F\u0443\u0442\u0435\u0439

CliArgs_run_on = \u0437\u0430\u043F\u0443\u0441\u0442\u0438\u0442\u044C \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u0439 \u0441\u043A\u0440\u0438\u043F\u0442 \u0432 \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u043E\u0439 \u0431\u0430\u0437\u0435 \u0434\u0430\u043D\u043D\u044B\u0445

CliArgs_run_on_target = \u0437\u0430\u043F\u0443\u0441\u0442\u0438\u0442\u044C \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u0439 \u0441\u043A\u0440\u0438\u043F\u0442 \u0432 \u0446\u0435\u043B\u0435\u0432\u043E\u0439 \u0431\u0430\u0437\u0435 \u0434\u0430\u043D\u043D\u044B\u0445

CliArgs_safe_mode = \u043D\u0435 \u0441\u043E\u0437\u0434\u0430\u0432\u0430\u0442\u044C \u0441\u043A\u0440\u0438\u043F\u0442\u044B, \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u0449\u0438\u0435 \u043E\u043F\u0430\u0441\u043D\u044B\u0435 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u044F\n\u0441\u043C.: --allow-danger-ddl

CliArgs_selected_only = \u043F\u043E\u0441\u0442\u0440\u043E\u0438\u0442\u044C \u0441\u043A\u0440\u0438\u043F\u0442, \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u00AB\u0432\u044B\u0431\u0440\u0430\u043D\u043D\u044B\u0435\u00BB \u043E\u0431\u044A\u0435\u043A\u0442\u044B, \u0441\u043A\u0440\u044B\u0442\u044C \u0434\u0440\u0443\u0433\u0438\u0435 \u043E\u0431\u044A\u0435\u043A\u0442\u044B\n\u0432 CLI, \u00AB\u0432\u044B\u0431\u0440\u0430\u043D\u043D\u044B\u0435\u00BB \u043E\u0437\u043D\u0430\u0447\u0430\u044E\u0442 \u043E\u0442\u0444\u0438\u043B\u044C\u0442\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u0435 \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E --allowed-object \u0438 \u0441\u043F\u0438\u0441\u043A\u043E\u0432 \u0438\u0433\u043D\u043E\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F

CliArgs_show_error = \u0432\u044B\u0432\u0435\u0441\u0442\u0438 \u0441\u0442\u0435\u043A\u0442\u0440\u0435\u0439\u0441 \u043E\u0448\u0438\u0431\u043A\u0438

CliArgs_simplify_views = \u0443\u043F\u0440\u043E\u0449\u0435\u043D\u043D\u043E\u0435 \u0444\u043E\u0440\u043C\u0430\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u0438\u0439 \u043F\u0440\u0438 \u0447\u0442\u0435\u043D\u0438\u0438 \u0447\u0435\u0440\u0435\u0437 JDBC (\u043D\u0435 \u0440\u0435\u043A\u043E\u043C\u0435\u043D\u0434\u0443\u0435\u0442\u0441\u044F PostgreSQL)

CliArgs_source = \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u0439 \u0441\u0445\u0435\u043C\u044B

CliArgs_src_lib = \u0434\u043E\u0431\u0430\u0432\u0438\u0442\u044C \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u0447\u043D\u0443\u044E \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u043E\u0441\u0442\u044C \u043A \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0443\n\u0443\u043A\u0430\u0437\u0430\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0440\u0430\u0437, \u0447\u0442\u043E\u0431\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A

CliArgs_src_lib_no_priv = \u0434\u043E\u0431\u0430\u0432\u0438\u0442\u044C \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u0447\u043D\u0443\u044E \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u043E\u0441\u0442\u044C \u0431\u0435\u0437 \u043F\u0440\u0438\u0432\u0438\u043B\u0435\u0433\u0438\u0439 \u043A \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0443\n\u0443\u043A\u0430\u0437\u0430\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0440\u0430\u0437, \u0447\u0442\u043E\u0431\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A

CliArgs_src_lib_xml = \u0434\u043E\u0431\u0430\u0432\u0438\u0442\u044C xml \u0441 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u0447\u043D\u044B\u043C\u0438 \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u043E\u0441\u0442\u044F\u043C\u0438 \u043A \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0443\n\u0443\u043A\u0430\u0437\u0430\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0440\u0430\u0437, \u0447\u0442\u043E\u0431\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E xml \u0441 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0430\u043C\u0438

CliArgs_stop_not_allowed = \u0432\u044B\u0445\u043E\u0434\u0438\u0442\u044C \u0441 \u043E\u0448\u0438\u0431\u043A\u043E\u0439, \u043A\u043E\u0433\u0434\u0430 --allowed-object \u0441\u043A\u0440\u044B\u0432\u0430\u0435\u0442 \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u044B\u0439 \u043E\u0431\u044A\u0435\u043A\u0442 \u0438\u0437 \u0441\u043A\u0440\u0438\u043F\u0442\u0430

CliArgs_target = \u043F\u0440\u0438\u0435\u043C\u043D\u0438\u043A \u0434\u043B\u044F \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u0439 \u0441\u0445\u0435\u043C\u044B (\u0442\u043E\u043B\u044C\u043A\u043E \u0432 \u0440\u0435\u0436\u0438\u043C\u0435 \u0441\u0440\u0430\u0432\u043D\u0435\u043D\u0438\u044F)

CliArgs_tgt_lib = \u0434\u043E\u0431\u0430\u0432\u0438\u0442\u044C \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u0447\u043D\u0443\u044E \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u043E\u0441\u0442\u044C \u043A \u043F\u0440\u0438\u0435\u043C\u043D\u0438\u043A\u0443\n\u0443\u043A\u0430\u0436\u0438\u0442\u0435 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0440\u0430\u0437, \u0447\u0442\u043E\u0431\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A

CliArgs_tgt_lib_no_priv = \u0434\u043E\u0431\u0430\u0432\u0438\u0442\u044C \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u0447\u043D\u0443\u044E \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u043E\u0441\u0442\u044C \u0431\u0435\u0437 \u043F\u0440\u0438\u0432\u0438\u043B\u0435\u0433\u0438\u0439 \u043A \u043F\u0440\u0438\u0435\u043C\u043D\u0438\u043A\u0443\n\u0443\u043A\u0430\u0436\u0438\u0442\u0435 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0440\u0430\u0437, \u0447\u0442\u043E\u0431\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A

CliArgs_tgt_lib_xml = \u0434\u043E\u0431\u0430\u0432\u0438\u0442\u044C xml \u0441 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u0447\u043D\u044B\u043C\u0438 \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u043E\u0441\u0442\u044F\u043C\u0438 \u043A \u043F\u0440\u0438\u0435\u043C\u043D\u0438\u043A\u0443\n\u0443\u043A\u0430\u0436\u0438\u0442\u0435 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0440\u0430\u0437, \u0447\u0442\u043E\u0431\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E xml \u0441 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0430\u043C\u0438

CliArgs_time_zone = \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u044B\u0439 \u0447\u0430\u0441\u043E\u0432\u043E\u0439 \u043F\u043E\u044F\u0441 \u043F\u0440\u0438 \u0440\u0430\u0431\u043E\u0442\u0435 \u0441 \u0431\u0430\u0437\u043E\u0439 \u0434\u0430\u043D\u043D\u044B\u0445, \u0430 \u0442\u0430\u043A\u0436\u0435 \u0434\u043E\u0431\u0430\u0432\u0438\u0442\u044C \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440 SET TIMEZONE \u0432 \u0441\u043A\u0440\u0438\u043F\u0442

CliArgs_update_project = \u043E\u0431\u043D\u043E\u0432\u0438\u0442\u044C \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0438\u0439 \u043F\u0440\u043E\u0435\u043A\u0442 \u0432 \u0440\u0435\u0436\u0438\u043C\u0435 parse

CliArgs_using_off = \u043D\u0435 \u043F\u0435\u0447\u0430\u0442\u0430\u0442\u044C \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435 USING \u0434\u043B\u044F ALTER COLUMN TYPE

CliArgs_verify_rule_set = \u043F\u0443\u0442\u044C \u043A \u0444\u0430\u0439\u043B\u0443 \u0441 \u043D\u0430\u0431\u043E\u0440\u043E\u043C \u043F\u0440\u0430\u0432\u0438\u043B \u0434\u043B\u044F \u0432\u0435\u0440\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u0438 \u043A\u043E\u0434\u0430

CliArgs_verify_source = \u043F\u0443\u0442\u044C \u043A \u0444\u0430\u0439\u043B\u0443 \u0438\u043B\u0438 \u043A\u0430\u0442\u0430\u043B\u043E\u0433\u0443 \u0434\u043B\u044F \u0432\u0435\u0440\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u0438 \u043A\u043E\u0434\u0430\n\u0443\u043A\u0430\u0436\u0438\u0442\u0435 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0440\u0430\u0437, \u0447\u0442\u043E\u0431\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u043F\u0443\u0442\u0435\u0439

DatabaseType_unsupported_type = \u041D\u0435\u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u043C\u044B\u0439 \u0442\u0438\u043F \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445:

Main_cach_clear = \u041A\u044D\u0448 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A \u043E\u0447\u0438\u0449\u0435\u043D

Main_danger_statements = \u0421\u043A\u0440\u0438\u043F\u0442 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442 \u043E\u043F\u0430\u0441\u043D\u044B\u0435 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u044B: {0}. \u0418\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 --allow-danger-ddl \u0434\u043B\u044F \u043F\u0435\u0440\u0435\u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F.

Main_show_stacktrace = \u0418\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 -E \u0434\u043B\u044F \u043F\u0440\u043E\u0441\u043C\u043E\u0442\u0440\u0430 \u0441\u0442\u0435\u043A\u0442\u0440\u0435\u0439\u0441\u0430 \u043E\u0448\u0438\u0431\u043A\u0438

UsageHelp = \u0418\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\n${tab}pgcodekeeper-cli [option]... SOURCE DEST\n${tab}pgcodekeeper-cli -s SOURCE -t DEST [option]...\n${tab}pgcodekeeper-cli --mode PARSE -o OUTDIR [--update-project] [option]... SOURCE\n${tab}pgcodekeeper-cli --mode GRAPH [option]... SOURCE\n${tab}pgcodekeeper-cli --mode INSERT --insert-name <name> --insert-filter <filter> [option]... SOURCE\n${tab}pgcodekeeper-cli --mode VERIFY --verify-rule-set <path> --verify-source <path> [option]...\n\n{0}\n{1}\n\n\u041F\u043E\u0440\u044F\u0434\u043E\u043A \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0438 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\n${tab}\u0411\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0438 \u0437\u0430\u0433\u0440\u0443\u0436\u0430\u044E\u0442\u0441\u044F \u0432 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0435\u043C \u043F\u043E\u0440\u044F\u0434\u043A\u0435:\n${tab}${tab}1. \u0411\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0438 \u0432 \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u044B\u0445 \u0441\u043F\u0438\u0441\u043A\u0430\u0445 XML.\n${tab}${tab}2. \u042F\u0432\u043D\u043E \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u044B\u0435 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0438.\n${tab}${tab}3. \u042F\u0432\u043D\u043E \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u044B\u0435 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0438 \u0431\u0435\u0437 \u043F\u0440\u0438\u0432\u0438\u043B\u0435\u0433\u0438\u0439.\n${tab}\u0412 \u043A\u0430\u0436\u0434\u043E\u0439 \u0433\u0440\u0443\u043F\u043F\u0435 \u043F\u043E\u0440\u044F\u0434\u043E\u043A \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442\u0441\u044F \u0437\u0430\u0434\u0430\u043D\u043D\u044B\u043C \u043F\u043E\u0440\u044F\u0434\u043A\u043E\u043C \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442\u0430. \u0412 \u043F\u0440\u0435\u0434\u0435\u043B\u0430\u0445 XML \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u043F\u043E\u0440\u044F\u0434\u043E\u043A \u0437\u0430\u043F\u0438\u0441\u0438.\n${tab}\u041E\u0431\u044A\u0435\u043A\u0442\u044B, \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043D\u043D\u044B\u0435 \u043F\u0435\u0440\u0432\u044B\u043C\u0438 \u0432 \u044D\u0442\u043E\u0439 \u043F\u043E\u0441\u043B\u0435\u0434\u043E\u0432\u0430\u0442\u0435\u043B\u044C\u043D\u043E\u0441\u0442\u0438, \u043C\u043E\u0433\u0443\u0442 \u043F\u0435\u0440\u0435\u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0442\u044C \u0442\u0435, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043D\u044B \u043F\u043E\u0437\u0436\u0435 (\u0435\u0441\u043B\u0438 --lib-safe-mode \u0432\u044B\u043A\u043B\u044E\u0447\u0435\u043D).\n\n\u041F\u043E\u0434\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u044F \u043A \u0430\u043A\u0442\u0438\u0432\u043D\u043E\u0439 \u0431\u0430\u0437\u0435 \u0434\u0430\u043D\u043D\u044B\u0445\n${tab}\u0418\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 URL-\u0430\u0434\u0440\u0435\u0441 \u043F\u043E\u0434\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u044F JDBC \u0434\u043B\u044F \u0443\u043A\u0430\u0437\u0430\u043D\u0438\u044F \u0430\u043A\u0442\u0438\u0432\u043D\u044B\u0445 \u0431\u0430\u0437 \u0434\u0430\u043D\u043D\u044B\u0445\n${tab}${tab}PostgreSQL: https://jdbc.postgresql.org/documentation/head/connect.html\n${tab}${tab}MS SQL: https://docs.microsoft.com/sql/connect/jdbc/building-the-connection-url\n${tab}${tab}ClickHouse: https://clickhouse.com/docs/en/integrations/java#configuration

Utils_error_get_version = \u043E\u0448\u0438\u0431\u043A\u0430: OSGI \u043D\u0435 \u0437\u0430\u043F\u0443\u0449\u0435\u043D

Version = \u0412\u0435\u0440\u0441\u0438\u044F: {0}
